In [4]:
import pandas as pd

#열 이름을 key로 하고, 리스트를 value로 하는 딕셔너리 정의 (2차원 배열)

dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [5]:
# pandas dataframe() 함수로 딕셔너리를 데이터 프레임으로 변환, 변수 df에 저장
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [7]:
print(df)
display(df) #예쁜 테이블

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [8]:
#행 인덱스/열 이름 설정
df = pd.DataFrame([[15,'남','덕영중'],
                  [17,'여','수리중']],
                  index=['준서','예은'],
                  columns = ['나이','성별','학교'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [9]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [10]:
# 행 인덱스/열 이름 바꾸기
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [11]:
df.rename(columns={'나이':'연령','학교':'소속'},inplace=True)
df.rename(index={'준서':'학생1','예은':'학생2'},inplace=True)
#inplace가 없으면 안바뀜 (바꾼 상태를 유지하라는 명령어)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [78]:
import pandas as pd

exam_data = {'수학' : [90,80,70], '영어' : [98,89,95],
            '음악' : [85,95,100], '체육' : [100,90,90]}
df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [13]:
df2 = df.copy()
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [14]:
df2.drop('우현',inplace=True)
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [15]:
df3 = df.copy()
df3.drop(['우현','인아'],axis=0,inplace=True)
print(df3)

    수학  영어  음악   체육
서준  90  98  85  100

In [16]:
df4 = df.copy()
df4.drop(['체육','음악'],axis=1,inplace=True)
print(df4)

    수학  영어
서준  90  98
우현  80  89
인아  70  95

In [17]:
# 행선택

In [48]:
# 행 인덱스를 사용해 행 1개를 선택
label1 = df.loc['서준'] #loc 인덱서
position1 = df.iloc[0] #iloc 인덱서
print('label1(loc)')
display(label1)
# series 형태로 출력됨

KeyError: '서준'

In [19]:
# 행 인덱스를 사용해 2개 이상의 행 선택
label2 = df.loc[['서준','인아']]
position2 = df.iloc[[0,2]]

print('label2(loc)')
display(label2)

print('-'*40)
print('position2(iloc)')
display(position2)

label2(loc)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

----------------------------------------
position2(iloc)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [20]:
# 행 인덱스 범위를 지정해 행 선택
label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]

print('label3(loc)')
display(label3)

print('-'*40)
print('position3(iloc)')
display(position3)

label3(loc)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

----------------------------------------
position3(iloc)

    수학  영어  음악   체육
서준  90  98  85  100

In [21]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [22]:
math1 = df['수학']
math1 #여러개 가져올 때

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [23]:
math2 = df.수학
math2 #하나만 가져올 때

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [24]:
music_gym = df[['음악','체육']]
music_gym #data_frame 으로 나옴

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [25]:
df.iloc[::2] #0행부터 2행 간격으로 선택

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [26]:
df.iloc[0:3:2] #0행부터 2행까지 2행 간격

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [27]:
# 원소 선택 -> 서준이의 수학 점수를 가져와보자.
print(df.loc['서준','수학'])
print(df.iloc[0,0])

90
90

In [28]:
a = df.loc['서준','음악']
a

85

In [29]:
b = df.iloc[0,2]
b

85

In [30]:
c = df.loc['서준',['음악','체육']]
c

음악     85
체육    100
Name: 서준, dtype: int64

In [31]:
d = df.iloc[0,[2,3]]
d

음악     85
체육    100
Name: 서준, dtype: int64

In [32]:
e = df.loc['서준','음악':'체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [33]:
f = df.iloc[0,2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [34]:
g = df.loc[['서준','우현'],['음악','체육']]
g

    음악   체육
서준  85  100
우현  95   90

In [35]:
h = df.iloc[[0,1],[2,3]]
h

    음악   체육
서준  85  100
우현  95   90

In [36]:
i = df.loc['서준':'우현','음악':'체육']
i

    음악   체육
서준  85  100
우현  95   90

In [37]:
j = df.iloc[0:2,2:]
j

    음악   체육
서준  85  100
우현  95   90

In [ ]:
# column명, index명은 중복을 허용하지 않는다.
#reset index 함수가 있으니 참고.

In [39]:
# 열 추가
df['국어'] = 80
df

    수학  영어   음악   체육  국어
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [82]:
exam_data = {'이름' : ['서준','우현','인아'],
             '수학' : [ 80, 30, 40],
             '영어' : [90 , 40, 60],
             '음악' : [85, 90, 100],
             '체육' : [100, 40, 70]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  80  90   85  100
1  우현  30  40   90   40
2  인아  40  60  100   70

In [71]:
# 행 추가
df.loc[3]=0
df

   이름  수학  영어   음악   체육
0  서준  80  90   85  100
1  우현  30  40   90   40
2  인아  40  60  100   70
3   0   0   0    0    0

In [72]:
df.loc[4] = ['동규',80,90,70,60]
df

   이름  수학  영어   음악   체육
0  서준  80  90   85  100
1  우현  30  40   90   40
2  인아  40  60  100   70
3   0   0   0    0    0
4  동규  80  90   70   60

In [46]:
df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  80  90   85  100
1   우현  30  40   90   40
2   인아  40  60  100   70
3    0   0   0    0    0
4   동규  80  90   70   60
행5   0   0   0    0    0

In [53]:
df = pd.DataFrame(exam_data)
df.set_index('이름',inplace=True)
df

KeyError: "None of ['이름'] are in the columns"

In [51]:
# 원소 값 변경
df.iloc[0][3] = 80
df

    수학  영어   음악  체육
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [57]:
df.loc['서준','체육'] = 98
df

    수학  영어   음악  체육
서준  90  98   85  98
우현  80  89   95  90
인아  70  95  100  90

In [59]:
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악  체육
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [60]:
df.loc['서준',['음악','체육']] = 100,70
df

    수학  영어   음악  체육
서준  90  98  100  70
우현  80  89   95  90
인아  70  95  100  90

In [73]:
df = df.transpose()
df

      0   1    2  3   4
이름   서준  우현   인아  0  동규
수학   80  30   40  0  80
영어   90  40   60  0  90
음악   85  90  100  0  70
체육  100  40   70  0  60

In [74]:
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  80  90   85  100
1  우현  30  40   90   40
2  인아  40  60  100   70
3   0   0   0    0    0
4  동규  80  90   70   60

In [76]:
# set_index : 특정 열을 행 인덱스로 설정
df.set_index(['이름'])

    수학  영어   음악   체육
이름
서준  80  90   85  100
우현  30  40   90   40
인아  40  60  100   70
0    0   0    0    0
동규  80  90   70   60

In [80]:
df = pd.DataFrame(exam_data)
df

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

In [83]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  80  90   85  100
우현  30  40   90   40
인아  40  60  100   70

In [84]:
ndf2 = ndf.set_index('음악')
ndf2

     수학  영어   체육
음악
85   80  90  100
90   30  40   40
100  40  60   70

In [86]:
# multi index
ndf3 = ndf.set_index(['수학','음악'])
ndf3

        영어   체육
수학 음악
80 85   90  100
30 90   40   40
40 100  60   70

In [87]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [88]:
df = pd.DataFrame(dict_data, index=['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [95]:
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index ) 
#채워질 게 없어서 빈 값을 자동으로 채움
# NaN = Not a Number # null값과 비슷하게 봐도 됨
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [97]:
ndf = df.reindex(new_index , fill_value = 0)
ndf #nan을 채우는 방법

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [98]:
df = pd.DataFrame(dict_data,index=['r0','r1','r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [99]:
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15